<!DOCTYPE html>
<html>

<head>
    <script src="updatePermissions.js"></script>
    <link rel="stylesheet" href="updatePermission.css" />
</head>

<body>
    <p class="heading">Wichtige Info zu &#x1F680;TUfast &#10071; &#10071;</p>
    <p><b>TUfast braucht eine zus&auml;tzliche Berechtigung, um weiterhin zu funktionieren. Du kannst die Berechtigung unten gleich akzeptieren oder dich im folgenden weiter Informieren.</b></p>
    <hr>
    <p>
        Bisher brauchte TUfast f&uuml;r jede Seite eine einzelne Berechtigung, um
        Aktionen durchzuf&uuml;hren (wie z.B. den AutoLogin). Dieses Vorgehen
        f&uuml;hrte zu einigen Problemen, weshalb wir uns entschieden haben,
        einmalig die Berechtigung f&uuml;r alle Domains (Webseiten) anzufragen.
    </p>
    <p>
        Dies f&uuml;hrt zu folgenden Vorteilen f&uuml;r die Nutzer und Entwickler
        von TUfast:
    </p>
    <ul style="margin: 0">
        <li>
            Die Nutzer m&uuml;ssen nicht die Berechtigungen f&uuml;r jede Website
            einzeln akzeptieren
        </li>
        <li>
            TUfast wird zuk&uuml;nftig bei jedem Nutzer garantiert richtig
            funktionieren
        </li>
       
        <li>
            Wir k&ouml;nnen deutlich einfacher und schneller neue Funktionen bringen
        </li>
         <li>
            F&uuml;r die Entwickler ist das Rechtemanagement deutlich einfacher
        </li>
    </ul>
    <p>
        TUfast wird weiterhin nur auf Webseiten funktionieren, die
        mit dem Studium an der TU Dresden zu tun haben. Au&szlig;erdem stellt
        diese Neuerung kein Sicherheitsrisiko auf Anwenderseite dar!
    </p>
    <p>
        <b>Wichtig: Um TUfast weiter zu verwenden, musst du diese Berechtigung akzeptieren.</b> Ansonsten deaktiviert sich TUfast bald automatisch.
        TUfast kann zwar sp&auml;ter manuell erneut
        aktiviert werden indem du die Berechtigung sp&auml;ter akzeptierst, das ist aber komplizierter als einfach die Berechtigung gleich
        zu Akzeptieren.
    </p>
    Noch ausf&uuml;hrlichere technische Informationen von uns erh&auml;ltst du
    <a href="https://docs.google.com/document/d/1B3E6X5-Yy4UryxzS7CD-4m-Xfs0GKmWbFWfRPEB6Zz0/edit"
        target="_blank">hier</a>. Du hast noch Fragen? Wende dich bitte an <a id="" href="mailto:frage@tu-fast.de?Subject=Feedback TUfast">frage@tu-fast.de</a>.
    <p>
        Sonst &auml;ndert sich nichts. Wir entwickeln TUfast f&uuml;r euch &#128153; und
        hoffen, euer Leben damit ein bisschen einfacher zu machen.
    </p>
    </p>
    
    <p>
    <hr>
        <b>Wir empfehlen jetzt auf "Akzeptieren" zu dr&uuml;cken, um TUfast weiterhin zu verwenden.</b>
    </p>
    <button class="button-deny" id="refuseDomains">Ablehnen</button>
    <button id="acceptDomains" style="margin-left: 30px" class="button-accept">
        Akzeptieren
    </button>
    <p>Liebe Gr&uuml;&szlig;e von Oli vom &#x1F680;TUfast Team &#128400;</p><br>
    <p>PS: eine coole neue Funktion ist bereits auf dem Weg &#129303;</p>
</body>

</html>